c------------------------------------------------------------------
c      粘度μ[Pa・s]の計算
c------------------------------------------------------------------
       function calvis(tt)
       implicit double precision(a-h,o-z)
       calvis=1d-3  !温度の関数
       if(tt.eq.-999d0)calvis=1d-3      !代表粘度μ0[Pa・s]:298Kにおける値
       return
       end
c------------------------------------------------------------------
c      密度ρ[kg/m3]の計算
c------------------------------------------------------------------
       function calden(tt)
       implicit double precision(a-h,o-z)
       calden=999.8d0   !温度の関数
       if(tt.eq.-999d0)calden=999.8d0     !代表温度ρ[kg/m3]:298Kにおける値
       return
       end